export const MEMBERS = [
  {
    name: "やま",
    description: "誰も憚らず“自分”でいられる場所を作りたい。それが私の想い。",
    badges: ["エンジニア", "価値観ドリブン", "ラーメン好き！"],
    image: {
      src: "/member/koryu.webp",
      alt: "やまの写真",
    },
  },
  {
    name: "えぬこじ",
    description: "自分の居場所であり、みんなの居場所。",
    badges: ["創設者", "人生は流しそうめん", "出会いを大切に"],
    image: {
      src: "/member/naoki.webp",
      alt: "えぬこじの写真",
    },
    sns: "https://x.com/nka21dev"
  },
  {
    name: "ねこみ",
    description: "学年関係なくおはなししてて微笑ましいなっておもう〜みんなおもしろくて優しい方々！",
    badges: ["締切とおえかきしてるひと", "言語化むずいって", "アイスを食べましょ！"],
    image: {
      src: "/member/nekomi.png",
      alt: "えぬこじの写真",
    },
    sns: "https://x.com/88_49"
  },
  {
    name: "神父",
    description: "ここはきっと、TECH.C.の梁山泊。あったかくて楽しくて、真剣になれる場所。",
    badges: ["アニメ科", "祝福する人", "メカクレ愛好家"],
    image: {
      src: "/member/shinpu.png",
      alt: "神父の写真",
    },
  },
  {
    name: "くにえだ",
    description: "学びから遊びまで、多領域・多学年のメンバーでの交流を通して、今と未来を最大化するきっかけの場",
    badges: ["エンジニア", "ボドゲ主催者", "人間愛好家"],
    image: {
      src: "/member/kunieda.png",
      alt: "神父の写真",
    },
  },
  {
    name: "よしきち",
    description: "縦横無尽に活躍できるあったけぇ場所",
    badges: ["いぇあ🤘", "夜の街と深海が好き", "フッ軽"],
    image: {
      src: "/member/yoshikiti.png",
      alt: "よしきちの写真",
    },
  },
  {
    name: "サチヲム",
    description: "気軽に話せて、色んな人の意見を聞けて、嬉しいね！",
    badges: ["明るく楽しく元気よく！", "自己理解を深められる場所", "あなたの人生に幸あれ。"],
    image: {
      src: "/member/satiwomu.png",
      alt: "サチヲムの写真",
    },
  },
  {
    name: "sakuyathx",
    description: "大体の事はなんとかなるのでラフに生きる",
    badges: ["InTechロゴ作者", "クリエイター", "超感覚派"],
    image: {
      src: "/member/sakuyathx.png",
      alt: "sakuyathxの写真",
    },
    sns: "https://x.com/SAKUYA_RL"
  },
  // {
  //   name: "",
  //   description: "",
  //   badges: [""],
  //   image: {
  //     src: "/member/.png",
  //     alt: "",
  //   },
  // },
  {
    name: "ryu",
    description:
      "ボドゲ楽しいよ！",
    badges: ["🧑‍💻","🍫","🏂"],
    image: {
      src: "/member/ryu.png",
      alt: "ryuの写真",
    },
    sns: "https://x.com/_ryu1013"
  },
]

export const MEMBER_GRADE_COUNTS = [
  { grade: "1年生", count: 20 },
  { grade: "2年生", count: 11 },
  { grade: "3年生", count: 8 },
  { grade: "4年生", count: 10 },
  { grade: "その他", count: 3 },
] as const

export const MEMBER_MAJOR_COUNTS = [
  { major: "IT・AI", count: 25 },
  { major: "CG・映像", count: 13 },
  { major: "イラスト・\nアニメ", count: 8 },
  { major: "ゲーム", count: 3 },
  { major: "その他", count: 3 },
] as const